<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c] 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 ]
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    //底部购物车配置
    'menu' => [
        ['name'   => '总金额','class'=>'amount'],//0
        ['name'   => '加入购物车','class'=>'add_cart'],//1
        ['name'   => '购物车','class'=>'add_cart_icon'],//2
        ['name'   => '立即购买','class'=>'buy_now'],//3
        ['name'   => '提交订单','class'=>'confirm_order'],//4
        ['name'   => '支付','class'=>'pay'],//5
        ['name'   => '增加地址','class'=>'address_save'],//6
        ['name'   => '修改地址','class'=>'address_save'],//7
        ['name'   => '新建地址','class'=>'address_create'],//8
        ['name'   => '去结算','class'=>'settlement'],//9
        ['name'   => '全选','class'=>'checked_all'],//10
        
    ],

];
